Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/returning_to_education/community_education.html.txt.tmx
Source language: en
Languages: ga

source: Community education refers to adult education and learning, generally outside the formal education sector, which aims to enhance learning, empower people and contribute to society
ga: Is é atá i gceist le hoideachas pobail ná oideachas agus foghlaim aosach, taobh amuigh d'earnáil an oideachais fhoirmiúil de ghnáth, atá dírithe ar fhoghlaim a fheabhsú, cumhacht a thabhairt do dhaoine agus cur leis an tsochaí

source: It promotes personalised learning and flexibility within the learning group
ga: Cuireann sé foghlaim phearsantaithe agus solúbthacht chun cinn laistigh den ghrúpa foghlama

source: Participants are involved as equal partners in identifying needs, designing and implementing programmes, and adapting them on an ongoing basis
ga: Glacann rannpháirtithe páirt mar chomhpháirtithe comhionanna le riachtanais a aithint, cláir a dhearadh agus a chur i bhfeidhm, agus iad a chur in oiriúint ar bhonn leanúnach

source: The goals of the community education sector include not just individual development but also community advancement, especially in marginalised communities
ga: Áirítear le cuspóirí earnáil an oideachais phobail ní hamháin forbairt an duine aonair ach dul chun cinn an phobail, go háirithe i bpobail ar an imeall

source: A key feature of community education programmes is that they provide the supports necessary for successful access and learning, particularly guidance, mentoring, continuous feedback and childcare
ga: Gné lárnach de chláir oideachais phobail ná go soláthraíonn siad na tacaí atá riachtanach do rochtain agus d'foghlaim, treoir, meantóireacht, aiseolas leanúnach agus cúram leanaí ach go háirithe

source: Community Education Facilitators work within the Education and Training Boards (ETBs) to give support to local community groups
ga: Oibríonn Éascaitheoirí Oideachais Phobail laistigh de na Boird Oideachais agus Oiliúna (BOO) le tacaíocht a thabhairt do ghrúpaí pobail áitiúla

source: This includes giving technical/administrative help, supporting the development, maintenance, and co-ordination of community education groups and strengthening links between the formal and non-formal education sectors
ga: Áirítear leis sin cabhair theicniúil/riaracháin a thabhairt, grúpaí oideachais phobail a fhorbairt, a chothabháil agus a chomhordú agus naisc a neartú idir earnáil an oideachais fhoirmiúil agus earnáil an oideachais neamhfhoirmiúil

source: They assist and support the development of new community-based educational initiatives
ga: Cabhraíonn siad agus tacaíonn siad le forbairt tionscnamh oideachasúil nua atá lonnaithe sa phobal

source: The Community Education Facilitators Association (CEFA) is their professional organisation
ga: Is é Cumann na n-Éascaitheoirí Oideachais Phobail an eagraíocht ghairmiúil atá acu

source: Back to Education Initiative
ga: An Tionscnamh Filleadh ar an Oideachas

source: The Back to Education Initiative (BTEI) provides opportunities for second-chance education to adult learners and early school-leavers who want to upgrade their skills
ga: Soláthraíonn sé deiseanna d'oideachas athdheise d'fhoghlaimeoirí aosacha agus do dhaoine a d'fhág an scoil go luath ar mian leo a gcuid scileanna a nuashonrú

source: The initiative allows learners to combine education with family, caring or work responsibilities
ga: Ligeann an tionscnamh seo d'fhoghlaimeoirí oideachas a chomhcheangal le freagrachtaí teaghlaigh, cúraim nó oibre

source: Role of ETBs in community education
ga: Ról na Boird Oideachais agus Oiliúna in oideachas pobail

source: The Community Education Services operate within the ETBs and give support services to community groups who are interested in community education as follows:
ga: Oibríonn na Seirbhísí Oideachais Phobail laistigh de na Boird Oideachais agus Oiliúna agus tugann siad tacaíocht do ghrúpaí pobail a bhfuil spéis acu in oideachas pobail ar na bealaí seo a leanas:

source: • Community Education Facilitators provide assistance and support to new or existing community education groups
ga: • Soláthraíonn Éascaitheoirí Oideachais Phobail cúnamh agus tacaíocht do ghrúpaí oideachais phobail nua nó reatha

source: They provide information on sources of funding and help community education interests to access funding
ga: Soláthraíonn siad eolas maidir le foinsí maoinithe agus cabhraíonn siad le páirtithe leasmhara in oideachas pobail rochtain a fháil ar mhaoiniú

source: • Assistance is also available for community education groups to develop their own educational programmes and courses
ga: • Tá cúnamh ar fáil freisin do ghrúpaí oideachais phobail le cabhrú leo a gcláir agus a gcúrsaí oideachais féin a fhorbairt

source: This backup may include technical, administrative or educational input
ga: D'fhéadfadh ionchur teicniúil, riaracháin nó oideachasúil bheith i gceist leis an tacaíocht sin

source: • They also facilitate networking with other groups and organisations with an interest in community education, and sharing good practice from other sectors
ga: • Tacaíonn siad le líonrú le grúpaí agus eagraíochtaí eile a bhfuil spéis acu in oideachas pobail, agus dea-chleachtas ó earnálacha eile a roinnt

source: Education and Training Boards
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna in áit coistí gairmoideachais

source: All services provided by VECs will continue to be provided by ETBs
ga: Leanfaidh na BOO an uile sheirbhíse soláthartha ag na coistí gairmoideachais a sholáthar

source: Community education courses generally use a combination of assessment methods such as assignments, projects, learners’ records, observations, skills demonstration and examinations
ga: Is gnách go n-úsáideann cúrsaí oideachais phobail meascán de chineálacha éagsúla modhanna measúnaithe mar thascanna, tionscadail, taifid foghlaimeoirí, breathnóireacht, léiriú scileanna agus scrúduithe

source: Accreditation has always posed challenges to non-formal education providers as it is not always a goal or a necessary outcome for all learners
ga: Chuir creidiúnú dúshláin faoi sholáthróirí oideachais foirmiúil nó neamhfhoirmiúil i gcónaí toisc nach i gcónaí a bhíonn sé mar chuspóir nó mar thoradh riachtanach do gach foghlaimeoir

source: However, the validity of learning in both the formal and non-formal environment has been recognised and worked into the National Framework of Qualifications - a single system against which all learning can be mapped
ga: Ach tugadh aitheantas dá bhailí agus atá foghlaim sa timpeallacht fhoirmiúil agus neamhfhoirmiúil araon agus tarraingíodh isteach í i gCreatoibre Náisiúnta na gCáilíochtaí, a chuireann córas aonair ar fáil, ar féidir an fhoghlaim go léir a mhapáil dá réir

source: It allows for learners to move from non-formal into formal education, from basic to further education, and from further into higher education in a relatively straightforward way
ga: Ligeann sé d'fhoghlaimeoirí bogadh ó oideachas foirmiúil go neamhfhoirmiúil, ó oideachas bunúsach go hoideachas breise, agus ó oideachas breise go hardoideachas ar bhealach réasúnta simplí

source: For more details about community education courses in your area, you should contact your local ETB or AONTAS
ga: Le tuilleadh sonraí a fháil maidir le cúrsaí oideachais phobail i do cheantar, ba cheart duit teagmháil a dhéanamh le do Boird Oideachais agus Oiliúna (BOO) áitiúil nó le AONTAS

source: Community organisations and groups applying for Back to Education Initiative (BTEI) funding should apply to their local ETB
ga: Féadann eagraíochtaí agus grúpaí pobail atá ag cur isteach ar mhaoiniú ón Tionscnamh Filleadh ar an Oideachas iarratas a chur isteach chuig an Boird Oideachais agus Oiliúna ina gceantar

source: The BTEI guidelines are available on the website of the Department of Education and Skills
ga: Tá an treoirlínte don Tionscnamh Filleadh ar an Oideachas ar fáil ar láithreán gréasáin na Roinne Oideachais agus Scileanna
